test/1D/wallLBM/0/f_1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 192.917;

boundaryField
{
    topWall
    {
        type            empty;
    }
    bottomWall
    {
        type            empty;
    }
    rightWall
    {
        type            lbmWall;
        wallVelocity    (0 0 0);
        index           1;
        value           uniform 4.66497e-310;
    }
    leftWall
    {
        type            lbmWall;
        wallVelocity    (0 0 0);
        index           1;
        value           uniform 4.66497e-310;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
