test/1D/wallLBM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    topWall
    {
        type            empty;
    }
    bottomWall
    {
        type            empty;
    }
    rightWall
    {
        type            calculated;
        value           uniform 100000;
    }
    leftWall
    {
        type            calculated;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
