test/1D/wallLBM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares; //leastSquares; //Gauss linear is widely used
								    // leastSquares is employed sometimes in FvLBM
}

divSchemes
{
    default         Gauss upwind;
    div(xi,f_1)     Gauss linearUpwind grad(f_1);
    div(xi,f_2)     Gauss linearUpwind grad(f_2);
    div(xi,f_0)     Gauss linear; //bounded Gauss upwind; // Gauss linearUpwind grad(f); // This was found in scalarTransportFoam
											// however there are a variety of bounded methods recomended for transport
}

laplacianSchemes
{
	default			none;
}

interpolationSchemes
{
    default         linear;
    f_1             linearUpwind;
    f_2             linearUpwind;
    feq_1           linearUpwind;
    feq_2           linearUpwind;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //

/* REF: https://doc.cfd.direct/openfoam/user-guide-v7/fvschemes */
